-- phpMyAdmin SQL Dump
-- version 2.10.0.2
-- http://www.phpmyadmin.net
-- 
-- 主机: localhost
-- 生成日期: 2012 年 02 月 08 日 11:15
-- 服务器版本: 5.5.20
-- PHP 版本: 5.2.4

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- 数据库: `app`
-- 

-- --------------------------------------------------------

-- 
-- 表的结构 `app`
-- 

CREATE TABLE `app` (
  `name` char(20) NOT NULL,
  `sequence` int(10) NOT NULL AUTO_INCREMENT,
  `size` int(10) NOT NULL,
  `discription` varchar(20) NOT NULL,
  `version` char(20) NOT NULL,
  `time` date NOT NULL,
  `categoryName` char(20) NOT NULL,
  `author` varchar(20) NOT NULL,
  `price` int(10) NOT NULL,
  `icon` char(20) NOT NULL,
  `download` int(20) NOT NULL,
  `truncation1` blob NOT NULL,
  `truncation2` blob NOT NULL,
  `truncation3` blob NOT NULL,
  `truncation4` blob NOT NULL,
  `software` blob NOT NULL,
  PRIMARY KEY (`sequence`)
) ENGINE=MyISAM  DEFAULT CHARSET=gb2312 AUTO_INCREMENT=123112 ;

-- 
-- 导出表中的数据 `app`
-- 

INSERT INTO `app` (`name`, `sequence`, `size`, `discription`, `version`, `time`, `categoryName`, `author`, `price`, `icon`, `download`, `truncation1`, `truncation2`, `truncation3`, `truncation4`, `software`) VALUES 
('chenjm', 12, 31, 'chenjm', '0', '2012-02-02', 'sport', 'chenjm', 21, '23423', 122, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3330666464306638352d333839302d343763332d393033302d3761343164643931383263312e6a7067, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3535623832303361662d383230342d346562332d623565352d6537353336323730313865302e6a7067, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3436366565643564312d313736332d346162372d623833312d3666393333636636396564322e6a7067, 0x443a2f777777726f6f742f6262626262622f756e7469746c65642e706e67, 0x443a2f777777726f6f742f6262626262622f6c6470695f31353836323030626262386532622d656563612d343933372d383838652d3264363934343839306337325f69636f6e2e706e67),
('酷狗音乐网络播放器', 1, 12, '酷狗音乐网络播放器', '4.1.0', '2012-01-30', 'entertainment', '广州酷狗计算机科技有限公司', 21, 'aa', 2132131, '', '', '', '', ''),
('陈嘉明', 123111, 21, '描述', '0', '2011-12-26', 'tool', '好汉', 123, '234', 333333, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3330666464306638352d333839302d343763332d393033302d3761343164643931383263312e6a7067, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3535623832303361662d383230342d346562332d623565352d6537353336323730313865302e6a7067, 0x443a2f777777726f6f742f6262626262622f6c6470695f3135383632305f3436366565643564312d313736332d346162372d623833312d3666393333636636396564322e6a7067, 0x443a2f777777726f6f742f6262626262622f756e7469746c65642e706e67, 0x443a2f777777726f6f742f6262626262622f6c6470695f31353836323030626262386532622d656563612d343933372d383838652d3264363934343839306337325f69636f6e2e706e67),
('益盟操盘手', 1001, 23, '益盟操盘手', '2.1.5', '2011-11-22', 'tool', '上海益盟软件', 23, '123', 234, '', '', '', '', ''),
('大众点评', 1002, 123, '大众点评', '4.6', '2012-02-18', 'tool', '大众点评', 234, '21', 123, '', '', '', '', ''),
('91乐淘', 1003, 25, '25', '3.4.5', '2012-03-23', 'tool', '91乐淘', 36, '36', 123, '', '', '', '', ''),
('永恒斗士', 1004, 66, '永恒斗士', '2.0.0', '2012-02-24', 'game', '永恒斗士', 36, '21', 33, '', '', '', '', ''),
('德斯尼亚传奇', 1005, 123, '德斯尼亚传奇', '1.0.6', '2011-12-16', 'game', 'GAMECILL Inc', 123, '34', 123, '', '', '', '', ''),
('360安全卫士', 1018, 62, '360安全卫士', '2.1.1', '2012-04-24', 'game', '360安全卫士', 57, '64', 83, '', '', '', '', ''),
('QQ播放器', 1008, 127, 'QQ播放器', '7.6', '2012-02-18', 'tool', 'QQ播放器', 24, '25', 12, '', '', '', '', ''),
('斗地主', 1015, 12, '斗地主', '1.3.6', '2011-12-16', 'game', 'GAMECILL Inc', 13, '36', 23, '', '', '', '', ''),
('迅雷7', 118, 127, '迅雷7', '7.6', '2012-02-18', 'tool', '迅雷7', 84, '28', 13, '', '', '', '', ''),
('愤怒的小鸟', 1108, 12, '愤怒的小鸟', '7.6.8', '2011-11-22', 'GAMECILL Inc', '愤怒的小鸟', 83, '68', 23, '', '', '', '', '');
